#include<iostream>
using namespace std;
int main() {
	int i, j,max=0,mid;
	int a[5];     //一维数组的初始定义方法，数组无法以变量或实数（带小数点的）定义长度，只能以常量
	int b[5] = {}; //数组之后加上“={}”/“={0}”是将其内值全部初始为0，否则在这里会自动补成-858993460，在DEV则是随机的
	int c[5] = { 1,2,3 };//这里未被初始化的部分会自动填0，但是只有在它定义时才会这么做，在调用后就同上,初始化不能溢出
	int arr[][4] = { 1 };//如果不给出行数，这里必须初始化，不然无法定义，给出行数就可以直接定义了，其余和一维数组一样
	for (i = 0; i < 5; i++)
		cout << c[i]<<'\t';    //数组调用时其可以使用变量指定序号，但序号是从零开始的
	cout << endl;
	cout << "请输入5个数\n";
	for (i = 0; i < 5; i++) {
		cin >> a[i];
	}
	for (i = 0; i < 5; i++)
		if (max < a[i])
			max = a[i];
	cout << "5个数中最大的数是" << max << '\n';
	for (i = 0; i < 4; i++)      //这里只要比到4就好了，其最后一位就是最大的经过循环
		for (j = i+1; j < 5; j++)//前面的已经是最小值了，无须再次比较故写j=i+1
			if (a[i] > a[j]) {
				mid = a[j];
				a[j] = a[i];
				a[i] = mid;
			}
	cout << "5个数从小到大排序为";
	for (i = 0; i < 5; i++)     //这里是变相的排序，不是标准的，其是每次比较数组里的数
		cout << a[i]<<'\t';     //带入研究就明白了
	for (i = 0; i < 5; i++)
		for (j = 0; j < 5; j++)
			if (a[i] > a[j]) {
				mid = a[j];
				a[j] = a[i];
				a[i] = mid;
			}
	cout << "5个数从大到小排序为";
	for (i = 0; i < 5; i++)
		cout << a[i] << '\t';
	cin.ignore();
	cin.get();
	return 0;
}              