#include<iostream>
using namespace std;
int main() {
	int a = 3;
	int* p;
	p = &a;   //指针在一定要对其进行赋初值的处理否则代码会报错
	int* p1 = &a;
	cout << "a=" << a << '\n';
	cout << "*p=" << *p << '\n';
	cout << "*p1=" << *p1 << '\n';
	/*指针的解引用就是在指针变量前加上一个* ，这时的* p与a是等效的（以上述的代码为例）可以理解为普通变量
	与指针变量是硬币的正反面，但多个指针可以指向同一个变量*/
	*p = 8;   //修改时要加上*，指针类型的变量不可以赋上用户自己给的值，这不合法，会导致程序崩溃
	//a = 8;
	cout << "a=" << a << '\n';
	cout << "*p=" << *p << '\n';
	cout << "*p1=" << *p1 << '\n'; 
	cout << "a=" << &a << '\t' << "p=" << p << '\t' << "p1=" << p1 << '\n';
	//每一次运行的代码地址不一样，系统自动分配的
	cin.ignore();
	cin.get();
	return 0;

}